-- Дозволяємо підключення з будь-якого джерела
ALTER SYSTEM SET listen_addresses = '*';

-- Надаємо права користувачу
GRANT ALL PRIVILEGES ON DATABASE students TO "user";

-- Створення таблиці
CREATE TABLE IF NOT EXISTS students (
    id SERIAL PRIMARY KEY,
    last_name VARCHAR(50) NOT NULL,
    first_name VARCHAR(50) NOT NULL,
    middle_name VARCHAR(50),
    birth_date DATE NOT NULL,
    record_book_number VARCHAR(20) UNIQUE NOT NULL
);

-- Заповнюємо таблицю обовтусами
INSERT INTO students (last_name, first_name, middle_name, birth_date, record_book_number)
VALUES
    ('Іваненко', 'Олег', 'Сергійович', '2001-02-15', '029673'),
    ('Петров', 'Андрій', 'Миколайович', '2000-03-20', '0352742'),
    ('Сидоренко', 'Марія', 'Олександрівна', '2002-04-10', '02952'),
    ('Коваленко', 'Оксана', 'Іванівна', '2001-05-25', '034567'),
    ('Петрова', 'Марія', 'Вікторівна', '2002-05-16', '028901'),
    ('Гончар', 'Віталій', 'Петрович', '2003-07-30', '037654'),
    ('Шевченко', 'Тарас', 'Григорович', '2000-01-12', '031234'),
    ('Франко', 'Іван', 'Якович', '2001-03-18', '029876'),
    ('Лисенко', 'Наталя', 'Петрівна', '2002-04-22', '036789'),
    ('Коваль', 'Олександр', 'Ігорович', '2000-05-14', '032109'),
    ('Бондар', 'Юлія', 'Василівна', '2001-07-03', '038765'),
    ('Мельник', 'Віктор', 'Олегович', '2002-08-19', '030987'),
    ('Савенко', 'Анна', 'Андріївна', '2000-09-25', '035432'),
    ('Павленко', 'Дмитро', 'Володимирович', '2001-10-11', '029345'),
    ('Кравченко', 'Ольга', 'Сергіївна', '2002-11-30', '034678'),
    ('Олійник', 'Сергій', 'Михайлович', '2000-12-05', '031567'),
    ('Ткаченко', 'Ірина', 'Олегівна', '2001-01-17', '039012'),
    ('Руденко', 'Василь', 'Петрович', '2002-02-28', '032345'),
    ('Савчук', 'Людмила', 'Іванівна', '2000-03-15', '037890'),
    ('Білий', 'Анатолій', 'Федорович', '2001-04-20', '030123'),
    ('Чернова', 'Ганна', 'Михайлівна', '2002-05-07', '035678'),
    ('Грищенко', 'Павло', 'Анатолійович', '2000-07-22', '031901'),
    ('Козак', 'Назар', 'Володимирович', '2001-08-14', '038234'),
    ('Пономаренко', 'Вікторія', 'Сергіївна', '2002-09-09', '032567'),
    ('Левченко', 'Артем', 'Іванович', '2000-10-18', '039890'),
    ('Марченко', 'Софія', 'Олексіївна', '2001-11-21', '033123'),
    ('Захарченко', 'Михайло', 'Юрійович', '2002-12-03', '030456'),
    ('Бойко', 'Алла', 'Володимирівна', '2000-01-29', '036789'),
    ('Герасименко', 'Роман', 'Олександрович', '2001-02-14', '032012'),
    ('Терещенко', 'Лариса', 'Петрівна', '2002-03-27', '039345')
ON CONFLICT (record_book_number) DO NOTHING;

-- Додаткові права на послідовність для автоінкременту
GRANT USAGE, SELECT ON SEQUENCE students_id_seq TO "user";